app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def index
    @brands = Brand.all

INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "pll"], ["created_at", "2015-11-11 03:29:14.060385"], ["updated_at", "2015-11-11 03:29:14.060385"]]
---
  def create
    @brand = Brand.new(brand_params)

    respond_to do |format|
      if @brand.save

UPDATE "brands" SET "name" = $1, "updated_at" = $2 WHERE "brands"."id" = $3  [["name", "pill"], ["updated_at", "2015-11-11 03:34:43.081546"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @brand.update(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_brand
      @brand = Brand.find(params[:id])