app/controllers/credit_cards_controller.rb

  def index
    @credit_cards = CreditCard.all
---
SELECT "credit_cards".* FROM "credit_cards"