app/controllers/drugs_controller.rb

SELECT "drugs".* FROM "drugs"
---
  def index
    @drugs = Drug.all