app/controllers/hospitals_controller.rb

SELECT "hospitals".* FROM "hospitals"
---
  def index
    @hospitals = Hospital.all