app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT "locations".* FROM "locations"