app/controllers/pills_controller.rb

  def index
    @pills = Pill.all
---
SELECT "pills".* FROM "pills"